zephyrproject-rtos/zephyr/ext/hal/ti/cc3200sdk/driverlib/rom_map.h
//*****************************************************************************
//
// Macros for the PRCM API.
//
//*****************************************************************************
#ifdef ROM_PRCMMCUReset
#define MAP_PRCMMCUReset \
        ROM_PRCMMCUReset
#else
#define MAP_PRCMMCUReset \
        PRCMMCUReset
#endif
#ifdef ROM_PRCMSysResetCauseGet
#define MAP_PRCMSysResetCauseGet \
        ROM_PRCMSysResetCauseGet
#else
#define MAP_PRCMSysResetCauseGet \
        PRCMSysResetCauseGet
#endif
#ifdef ROM_PRCMPeripheralClkEnable
#define MAP_PRCMPeripheralClkEnable \
        ROM_PRCMPeripheralClkEnable
#else
#define MAP_PRCMPeripheralClkEnable \
        PRCMPeripheralClkEnable
#endif
#ifdef ROM_PRCMPeripheralClkDisable
#define MAP_PRCMPeripheralClkDisable \
        ROM_PRCMPeripheralClkDisable
#else
#define MAP_PRCMPeripheralClkDisable \
        PRCMPeripheralClkDisable
#endif
#ifdef ROM_PRCMPeripheralReset
#define MAP_PRCMPeripheralReset \
        ROM_PRCMPeripheralReset
#else
#define MAP_PRCMPeripheralReset \
        PRCMPeripheralReset
#endif
#ifdef ROM_PRCMPeripheralStatusGet
#define MAP_PRCMPeripheralStatusGet \
        ROM_PRCMPeripheralStatusGet
#else
#define MAP_PRCMPeripheralStatusGet \
        PRCMPeripheralStatusGet
#endif
#ifdef ROM_PRCMI2SClockFreqSet
#define MAP_PRCMI2SClockFreqSet \
        ROM_PRCMI2SClockFreqSet
#else
#define MAP_PRCMI2SClockFreqSet \
        PRCMI2SClockFreqSet
#endif
#ifdef ROM_PRCMPeripheralClockGet
#define MAP_PRCMPeripheralClockGet \
        ROM_PRCMPeripheralClockGet
#else
#define MAP_PRCMPeripheralClockGet \
        PRCMPeripheralClockGet
#endif
#ifdef ROM_PRCMSleepEnter
#define MAP_PRCMSleepEnter \
        ROM_PRCMSleepEnter
#else
#define MAP_PRCMSleepEnter \
        PRCMSleepEnter
#endif
#ifdef ROM_PRCMDeepSleepEnter
#define MAP_PRCMDeepSleepEnter \
        ROM_PRCMDeepSleepEnter
#else
#define MAP_PRCMDeepSleepEnter \
        PRCMDeepSleepEnter
#endif
#ifdef ROM_PRCMSRAMRetentionEnable
#define MAP_PRCMSRAMRetentionEnable \
        ROM_PRCMSRAMRetentionEnable
#else
#define MAP_PRCMSRAMRetentionEnable \
        PRCMSRAMRetentionEnable
#endif
#ifdef ROM_PRCMSRAMRetentionDisable
#define MAP_PRCMSRAMRetentionDisable \
        ROM_PRCMSRAMRetentionDisable
#else
#define MAP_PRCMSRAMRetentionDisable \
        PRCMSRAMRetentionDisable
#endif
#ifdef ROM_PRCMLPDSEnter
#define MAP_PRCMLPDSEnter \
        ROM_PRCMLPDSEnter
#else
#define MAP_PRCMLPDSEnter \
        PRCMLPDSEnter
#endif
#ifdef ROM_PRCMLPDSIntervalSet
#define MAP_PRCMLPDSIntervalSet \
        ROM_PRCMLPDSIntervalSet
#else
#define MAP_PRCMLPDSIntervalSet \
        PRCMLPDSIntervalSet
#endif
#ifdef ROM_PRCMLPDSWakeupSourceEnable
#define MAP_PRCMLPDSWakeupSourceEnable \
        ROM_PRCMLPDSWakeupSourceEnable
#else
#define MAP_PRCMLPDSWakeupSourceEnable \
        PRCMLPDSWakeupSourceEnable
#endif
#ifdef ROM_PRCMLPDSWakeupCauseGet
#define MAP_PRCMLPDSWakeupCauseGet \
        ROM_PRCMLPDSWakeupCauseGet
#else
#define MAP_PRCMLPDSWakeupCauseGet \
        PRCMLPDSWakeupCauseGet
#endif
#ifdef ROM_PRCMLPDSWakeUpGPIOSelect
#define MAP_PRCMLPDSWakeUpGPIOSelect \
        ROM_PRCMLPDSWakeUpGPIOSelect
#else
#define MAP_PRCMLPDSWakeUpGPIOSelect \
        PRCMLPDSWakeUpGPIOSelect
#endif
#ifdef ROM_PRCMLPDSWakeupSourceDisable
#define MAP_PRCMLPDSWakeupSourceDisable \
        ROM_PRCMLPDSWakeupSourceDisable
#else
#define MAP_PRCMLPDSWakeupSourceDisable \
        PRCMLPDSWakeupSourceDisable
#endif
#ifdef ROM_PRCMHibernateEnter
#define MAP_PRCMHibernateEnter \
        ROM_PRCMHibernateEnter
#else
#define MAP_PRCMHibernateEnter \
        PRCMHibernateEnter
#endif
#ifdef ROM_PRCMHibernateWakeupSourceEnable
#define MAP_PRCMHibernateWakeupSourceEnable \
        ROM_PRCMHibernateWakeupSourceEnable
#else
#define MAP_PRCMHibernateWakeupSourceEnable \
        PRCMHibernateWakeupSourceEnable
#endif
#ifdef ROM_PRCMHibernateWakeupCauseGet
#define MAP_PRCMHibernateWakeupCauseGet \
        ROM_PRCMHibernateWakeupCauseGet
#else
#define MAP_PRCMHibernateWakeupCauseGet \
        PRCMHibernateWakeupCauseGet
#endif
#ifdef ROM_PRCMHibernateWakeUpGPIOSelect
#define MAP_PRCMHibernateWakeUpGPIOSelect \
        ROM_PRCMHibernateWakeUpGPIOSelect
#else
#define MAP_PRCMHibernateWakeUpGPIOSelect \
        PRCMHibernateWakeUpGPIOSelect
#endif
#ifdef ROM_PRCMHibernateWakeupSourceDisable
#define MAP_PRCMHibernateWakeupSourceDisable \
        ROM_PRCMHibernateWakeupSourceDisable
#else
#define MAP_PRCMHibernateWakeupSourceDisable \
        PRCMHibernateWakeupSourceDisable
#endif
#ifdef ROM_PRCMHibernateIntervalSet
#define MAP_PRCMHibernateIntervalSet \
        ROM_PRCMHibernateIntervalSet
#else
#define MAP_PRCMHibernateIntervalSet \
        PRCMHibernateIntervalSet
#endif
#ifdef ROM_PRCMSlowClkCtrGet
#define MAP_PRCMSlowClkCtrGet \
        ROM_PRCMSlowClkCtrGet
#else
#define MAP_PRCMSlowClkCtrGet \
        PRCMSlowClkCtrGet
#endif
#ifdef ROM_PRCMSlowClkCtrMatchSet
#define MAP_PRCMSlowClkCtrMatchSet \
        ROM_PRCMSlowClkCtrMatchSet
#else
#define MAP_PRCMSlowClkCtrMatchSet \
        PRCMSlowClkCtrMatchSet
#endif
#ifdef ROM_PRCMSlowClkCtrMatchGet
#define MAP_PRCMSlowClkCtrMatchGet \
        ROM_PRCMSlowClkCtrMatchGet
#else
#define MAP_PRCMSlowClkCtrMatchGet \
        PRCMSlowClkCtrMatchGet
#endif
#ifdef ROM_PRCMOCRRegisterWrite
#define MAP_PRCMOCRRegisterWrite \
        ROM_PRCMOCRRegisterWrite
#else
#define MAP_PRCMOCRRegisterWrite \
        PRCMOCRRegisterWrite
#endif
#ifdef ROM_PRCMOCRRegisterRead
#define MAP_PRCMOCRRegisterRead \
        ROM_PRCMOCRRegisterRead
#else
#define MAP_PRCMOCRRegisterRead \
        PRCMOCRRegisterRead
#endif
#ifdef ROM_PRCMIntRegister
#define MAP_PRCMIntRegister \
        ROM_PRCMIntRegister
#else
#define MAP_PRCMIntRegister \
        PRCMIntRegister
#endif
#ifdef ROM_PRCMIntUnregister
#define MAP_PRCMIntUnregister \
        ROM_PRCMIntUnregister
#else
#define MAP_PRCMIntUnregister \
        PRCMIntUnregister
#endif
#ifdef ROM_PRCMIntEnable
#define MAP_PRCMIntEnable \
        ROM_PRCMIntEnable
#else
#define MAP_PRCMIntEnable \
        PRCMIntEnable
#endif
#ifdef ROM_PRCMIntDisable
#define MAP_PRCMIntDisable \
        ROM_PRCMIntDisable
#else
#define MAP_PRCMIntDisable \
        PRCMIntDisable
#endif
#ifdef ROM_PRCMIntStatus
#define MAP_PRCMIntStatus \
        ROM_PRCMIntStatus
#else
#define MAP_PRCMIntStatus \
        PRCMIntStatus
#endif
#ifdef ROM_PRCMRTCInUseSet
#define MAP_PRCMRTCInUseSet \
        ROM_PRCMRTCInUseSet
#else
#define MAP_PRCMRTCInUseSet \
        PRCMRTCInUseSet
#endif
#ifdef ROM_PRCMRTCInUseGet
#define MAP_PRCMRTCInUseGet \
        ROM_PRCMRTCInUseGet
#else
#define MAP_PRCMRTCInUseGet \
        PRCMRTCInUseGet
#endif
#ifdef ROM_PRCMRTCSet
#define MAP_PRCMRTCSet \
        ROM_PRCMRTCSet
#else
#define MAP_PRCMRTCSet \
        PRCMRTCSet
#endif
#ifdef ROM_PRCMRTCGet
#define MAP_PRCMRTCGet \
        ROM_PRCMRTCGet
#else
#define MAP_PRCMRTCGet \
        PRCMRTCGet
#endif
#ifdef ROM_PRCMRTCMatchSet
#define MAP_PRCMRTCMatchSet \
        ROM_PRCMRTCMatchSet
#else
#define MAP_PRCMRTCMatchSet \
        PRCMRTCMatchSet
#endif
#ifdef ROM_PRCMRTCMatchGet
#define MAP_PRCMRTCMatchGet \
        ROM_PRCMRTCMatchGet
#else
#define MAP_PRCMRTCMatchGet \
        PRCMRTCMatchGet
#endif
#ifdef ROM_PRCMLPDSRestoreInfoSet
#define MAP_PRCMLPDSRestoreInfoSet \
        ROM_PRCMLPDSRestoreInfoSet
#else
#define MAP_PRCMLPDSRestoreInfoSet \
        PRCMLPDSRestoreInfoSet
#endif

#ifdef ROM_PRCMHIBRegRead
#define MAP_PRCMHIBRegRead \
        ROM_PRCMHIBRegRead
#else
#define MAP_PRCMHIBRegRead \
        PRCMHIBRegRead
#endif

#ifdef ROM_PRCMHIBRegWrite
#define MAP_PRCMHIBRegWrite \
        ROM_PRCMHIBRegWrite
#else
#define MAP_PRCMHIBRegWrite \
        PRCMHIBRegWrite
#endif

//*****************************************************************************
//
// Macros for the HWSPINLOCK API.
//
//*****************************************************************************
#ifdef ROM_HwSpinLockAcquire
#define MAP_HwSpinLockAcquire \
        ROM_HwSpinLockAcquire
#else
#define MAP_HwSpinLockAcquire \
        HwSpinLockAcquire
#endif
#ifdef ROM_HwSpinLockTryAcquire
#define MAP_HwSpinLockTryAcquire \
        ROM_HwSpinLockTryAcquire
#else
#define MAP_HwSpinLockTryAcquire \
        HwSpinLockTryAcquire
#endif
#ifdef ROM_HwSpinLockRelease
#define MAP_HwSpinLockRelease \
        ROM_HwSpinLockRelease
#else
#define MAP_HwSpinLockRelease \
        HwSpinLockRelease
#endif
#ifdef ROM_HwSpinLockTest
#define MAP_HwSpinLockTest \
        ROM_HwSpinLockTest
#else
#define MAP_HwSpinLockTest \
        HwSpinLockTest
#endif

//*****************************************************************************
//
// Macros for the ADC API.
//
//*****************************************************************************
#ifdef ROM_ADCEnable
#define MAP_ADCEnable \
        ROM_ADCEnable
#else
#define MAP_ADCEnable \
        ADCEnable
#endif
#ifdef ROM_ADCDisable
#define MAP_ADCDisable \
        ROM_ADCDisable
#else
#define MAP_ADCDisable \
        ADCDisable
#endif
#ifdef ROM_ADCChannelEnable
#define MAP_ADCChannelEnable \
        ROM_ADCChannelEnable
#else
#define MAP_ADCChannelEnable \
        ADCChannelEnable
#endif
#ifdef ROM_ADCChannelDisable
#define MAP_ADCChannelDisable \
        ROM_ADCChannelDisable
#else
#define MAP_ADCChannelDisable \
        ADCChannelDisable
#endif
#ifdef ROM_ADCIntRegister
#define MAP_ADCIntRegister \
        ROM_ADCIntRegister
#else
#define MAP_ADCIntRegister \
        ADCIntRegister
#endif
#ifdef ROM_ADCIntUnregister
#define MAP_ADCIntUnregister \
        ROM_ADCIntUnregister
#else
#define MAP_ADCIntUnregister \
        ADCIntUnregister
#endif
#ifdef ROM_ADCIntEnable
#define MAP_ADCIntEnable \
        ROM_ADCIntEnable
#else
#define MAP_ADCIntEnable \
        ADCIntEnable
#endif
#ifdef ROM_ADCIntDisable
#define MAP_ADCIntDisable \
        ROM_ADCIntDisable
#else
#define MAP_ADCIntDisable \
        ADCIntDisable
#endif
#ifdef ROM_ADCIntStatus
#define MAP_ADCIntStatus \
        ROM_ADCIntStatus
#else
#define MAP_ADCIntStatus \
        ADCIntStatus
#endif
#ifdef ROM_ADCIntClear
#define MAP_ADCIntClear \
        ROM_ADCIntClear
#else
#define MAP_ADCIntClear \
        ADCIntClear
#endif
#ifdef ROM_ADCDMAEnable
#define MAP_ADCDMAEnable \
        ROM_ADCDMAEnable
#else
#define MAP_ADCDMAEnable \
        ADCDMAEnable
#endif
#ifdef ROM_ADCDMADisable
#define MAP_ADCDMADisable \
        ROM_ADCDMADisable
#else
#define MAP_ADCDMADisable \
        ADCDMADisable
#endif
#ifdef ROM_ADCChannelGainSet
#define MAP_ADCChannelGainSet \
        ROM_ADCChannelGainSet
#else
#define MAP_ADCChannelGainSet \
        ADCChannelGainSet
#endif
#ifdef ROM_ADCChannleGainGet
#define MAP_ADCChannleGainGet \
        ROM_ADCChannleGainGet
#else
#define MAP_ADCChannleGainGet \
        ADCChannleGainGet
#endif
#ifdef ROM_ADCTimerConfig
#define MAP_ADCTimerConfig \
        ROM_ADCTimerConfig
#else
#define MAP_ADCTimerConfig \
        ADCTimerConfig
#endif
#ifdef ROM_ADCTimerEnable
#define MAP_ADCTimerEnable \
        ROM_ADCTimerEnable
#else
#define MAP_ADCTimerEnable \
        ADCTimerEnable
#endif
#ifdef ROM_ADCTimerDisable
#define MAP_ADCTimerDisable \
        ROM_ADCTimerDisable
#else
#define MAP_ADCTimerDisable \
        ADCTimerDisable
#endif
#ifdef ROM_ADCTimerReset
#define MAP_ADCTimerReset \
        ROM_ADCTimerReset
#else
#define MAP_ADCTimerReset \
        ADCTimerReset
#endif
#ifdef ROM_ADCTimerValueGet
#define MAP_ADCTimerValueGet \
        ROM_ADCTimerValueGet
#else
#define MAP_ADCTimerValueGet \
        ADCTimerValueGet
#endif
#ifdef ROM_ADCFIFOLvlGet
#define MAP_ADCFIFOLvlGet \
        ROM_ADCFIFOLvlGet
#else
#define MAP_ADCFIFOLvlGet \
        ADCFIFOLvlGet
#endif
#ifdef ROM_ADCFIFORead
#define MAP_ADCFIFORead \
        ROM_ADCFIFORead
#else
#define MAP_ADCFIFORead \
        ADCFIFORead
#endif

#endif // __ROM_MAP_H__
